robotology/icub-firmware/emBODY/eBcode/arch-dspic/board/2foc/appl/2FOC-V3/src/2FOC.c
void setMaxCurrent(int nom, int peak, int ovr)
{
    Inom = nom;
    Ipeak = peak;
    I2nom = (long)nom*(long)nom;
    I2Tlimit = ((long)peak*(long)peak - I2nom) * 10;
    Iovr = ovr;
}

void setMaxTemperature(int peak)
{
    gTemperatureLimit = peak;
}

void setIPid(int kp, int ki, int kbemf, char shift)
{
    IKp    = kp;
    IKi    = ki/2;
    IKbemf = kbemf;
    IKs    = shift;
    
    if (ki == 0) ZeroControlReferences();
                    
    IIntLimit = ((long)PWM_MAX)<<shift;
}

void setSPid(int kp, int ki, int kf, char shift)
{
    SKp = kp;
    SKi = ki/2;
    SKf = kf;
    SKs = shift;
    
    if (ki == 0) ZeroControlReferences();
    
    SIntLimit = ((long)PWM_MAX)<<shift;
}

void ZeroControlReferences()
{
    CtrlReferences.VqRef = 0;
    CtrlReferences.IqRef = 0;
    CtrlReferences.WRef = 0;

    VdA = 0;
    VqA = 0;
    VqL = 0;
    VqRef = 0;
    IqRef = 0;
    speed_error_old = 0;
    IsA = 0;
    iQerror_old = 0;
    iDerror_old = 0;
    iQprot = 0;
    // TODO: zero position and sensored torque references
}

void RequestControlMode(char cm)
{
    //if (cm == gControlMode) return;

    ZeroControlReferences();

    ++gCtrlModeReqCnt;
    gCtrlModeReq = cm;
}

void ResetSetpointWatchdog()
{
    WriteTimer5(0);
    IFS1bits.T5IF = 0;
}

        ///////////////////////////
        /*
        static int qe_watchdog = 0;
        if (delta)
        {
            QEisOk = 1;
            qe_watchdog = 0;
        }
        else if (!MotorConfig.has_hall)
        {
            if ((I2Tdata.IQMeasured > Ipeak/2) || (I2Tdata.IQMeasured < -Ipeak/2))
            {
                if (++qe_watchdog > 10000)
                {
                    // QE is broken
                    qe_watchdog = 0;
                    gEncoderError.stuck = TRUE;
                    SysError.EncoderFault = TRUE;
                    FaultConditionsHandler();
                }
            }
        }
        */
        ///////////////////////////

BOOL updateOdometry()
{
    static int vel_loop_clock = 0;
    
    if (MotorConfig.has_qe || MotorConfig.has_speed_qe)
    {        
        static int position_old = 0;
        int position = QEgetPos();
        int delta = position - position_old;

        position_old = position;

        if (sAlignInProgress)
        {
            gQEPosition = 0;
            gQEVelocity = 0;
            return FALSE;
        }

        gQEPosition += delta;

        #define UNDERSAMPLING 20 // PWMFREQUENCY / 1000;
        static int samples_circ_buffer[UNDERSAMPLING];
        static BOOL init_samples = TRUE;
        static int head = 0;   
        
        if (init_samples)
        {
            int i;
            
            for (i=0; i<UNDERSAMPLING; ++i) samples_circ_buffer[i] = gQEPosition;
            
            init_samples = FALSE;
        }
        
        // gQEVelocity = (1 + gQEVelocity + gQEPosition - samples_circ_buffer[head]) / 2;        
        gQEVelocity = gQEPosition - samples_circ_buffer[head];
        samples_circ_buffer[head++] = gQEPosition;
        head %= UNDERSAMPLING;
        
        if (++vel_loop_clock >= 20)
        {
            vel_loop_clock = 0;
            return TRUE;
        }
        else
        {
            return FALSE;
        }
    }
    else if (MotorConfig.has_hall)
    {
        gQEPosition = DHESPosition();
        gQEVelocity = DHESVelocity();

        return FALSE;
    }

    return FALSE;
}
/*
BOOL updateOdometry()
{
    if (MotorConfig.has_qe || MotorConfig.has_speed_qe)
    {
        static const int UNDERSAMPLING = PWMFREQUENCY / 1000;
        static int speed_undersampler = 0;

        static int position_old = 0;
        int position = QEgetPos();
        int delta = position - position_old;

        position_old = position;

        if (sAlignInProgress)
        {
            gQEPosition = 0;
            gQEVelocity = 0;
            return FALSE;
        }

        gQEPosition += delta;

        if (++speed_undersampler == UNDERSAMPLING) // we obtain ticks per ms
        {
            speed_undersampler = 0;

            static long QEPosition_old = 0;

            gQEVelocity = (1 + gQEVelocity + gQEPosition - QEPosition_old) / 2;

            QEPosition_old = gQEPosition;

            return TRUE;
        }

        return FALSE;
    }
    else if (MotorConfig.has_hall)
    {
        gQEPosition = DHESPosition();
        gQEVelocity = DHESVelocity();

        return FALSE;
    }

    return FALSE;
}
*/

volatile int rotorAfbk = 0;
volatile int rotorBfbk = 0;

int alignRotor(volatile int* IqRef)
{
    if (MotorConfig.has_hall) return 0;

    if (!sAlignInProgress) return 0;

    static int encoder_fake = 0;

    static int IqRef_fake = 0;

    const int ENCODER_1_5_REV = (3*QE_ELETTR_DEG_PER_REV())/2;

    if (sAlignInProgress < 3)
    {
        if (QEIndexFound())
        {
            sAlignInProgress = gEncoderConfig.full_calibration ? 3 : 0;
            gEncoderError.uncalibrated = 0;
            QEcountErrorClear();
        }
    }

    static int deltaA =  60;
    static int deltaB = -60;

    //static int deltaA = -120;
    //static int deltaB =    0;

    if (sAlignInProgress == 1)
    {
        static int timer = 0;

        if (IqRef_fake < Inom/2)
        {
            ++IqRef_fake;
        }
        else if (encoder_fake < ENCODER_1_5_REV)
        {
            if (++timer > alignRotorTimerConst) { timer = 0; ++encoder_fake;}
        }
        else
        {
            deltaA = -120;
            deltaB = 0;
            sAlignInProgress = 2;
        }
    }

    if (sAlignInProgress == 2)
    {
        static int timer = 0;

        if (encoder_fake > -ENCODER_1_5_REV)
        {
            if (++timer > alignRotorTimerConst) { timer = 0; --encoder_fake; }
        }
        else
        {
            // Index is broken
            *IqRef = IqRef_fake = 0;
            QE_RISE_ERROR(index_broken);
            sAlignInProgress = 0;
        }
    }
    ////////////////////////////////////

    static int encoder_fake_0 = 0x7FFF;

    if (sAlignInProgress == 3)
    {
        static int timer = 0;

        encoder_fake_0 = encoder_fake;

        if (IqRef_fake < Inom)
        {
            ++IqRef_fake;
        }
        else if (++timer > 10000)
        {
            sAlignInProgress = 4;
        }
    }

    static int rotorA;
    static int rotorB;

