robotology/icub-firmware/emBODY/eBcode/arch-dspic/board/2foc/appl/2FOC-V3/src/2FOC.c
    static unsigned int timer = 0;

    if (sAlignInProgress == 4)
    {
        encoder_fake = encoder_fake_0 + deltaA;

        if (++timer > 30000)
        {
            rotorA = __builtin_divsd(__builtin_mulss((int)POSCNT, gEncoderConfig.elettr_deg_per_rev),QE_RESOLUTION);

            timer = 0;

            sAlignInProgress = 5;
        }
    }

    if (sAlignInProgress == 5)
    {
        encoder_fake = encoder_fake_0 + deltaB;

        if (++timer > 60000)
        {
            IqRef_fake = 0;

            rotorB = __builtin_divsd(__builtin_mulss((int)POSCNT, gEncoderConfig.elettr_deg_per_rev),QE_RESOLUTION);

            int delta = rotorB - rotorA;

            while (delta >= 180) delta -= 360;
            while (delta < -180) delta += 360;

            if (abs(delta) > 90)
            {
                int angle = rotorA + delta/2;

                while (angle >= 360) angle -= 360;
                while (angle <    0) angle += 360;

                rotorAfbk = rotorA;
                rotorBfbk = rotorB;

                gEncoderConfig.offset = encoder_fake_0 + (deltaA + deltaB)/2 + 90 - angle;

                while (gEncoderConfig.offset >= 360) gEncoderConfig.offset -= 360;
                while (gEncoderConfig.offset <    0) gEncoderConfig.offset += 360;

                sAlignInProgress = 0;
            }
            else
            {
                if (deltaB)
                {
                    deltaB = 0;
                    deltaA = -120;
                    timer = 0;
                    sAlignInProgress = 4;
                }
                else
                {
                    // Index is broken
                    *IqRef = IqRef_fake = 0;
                    gEncoderError.uncalibrated = 0;
                    QE_RISE_ERROR(autocalib);
                    sAlignInProgress = 0;
                }
            }
        }
    }

    /////////////////////////////////////

    *IqRef = IqRef_fake;

    int encoder = encoder_fake;

    while (encoder >= 360) encoder -= 360;
    while (encoder <    0) encoder += 360;

    return encoder;
}

// DMA0 IRQ Service Routine used for FOC loop

volatile int ElDegfbk = 0;
volatile int CurLimfbk = 0;
volatile int VqFbk = 0;
volatile int IqFbk = 0;

void __attribute__((__interrupt__, no_auto_psv)) _DMA0Interrupt(void)
{
    int Vq = 0;

    static const int cos_table[] = {32767,32763,32748,32723,32688,32643,32588,32523,32449,32364,32270,32165,32051,31928,31794,31651,31498,31336,31164,30982,30791,30591,30381,30163,29935,29697,29451,29196,28932,28659,28377};
    static const int sin_table[] = {    0,  330,  660,  990, 1319, 1648, 1977, 2305, 2632, 2959, 3285, 3609, 3933, 4255, 4576, 4896, 5214, 5531, 5846, 6159, 6470, 6779, 7087, 7392, 7694, 7995, 8293, 8588, 8881, 9171, 9459};

    static int *ppwmH = NULL, *ppwmL = NULL, *ppwm0 = NULL;
    static int Va = 0, Vb = 0, Vc = 0;

    static short *iH,*iL,*i0;

    //static BOOL starting = TRUE;

    // setting CORCON in this way rather than using CORCONbits is
    // slightly more efficient (because CORCONbits is volatile and
    // optimizer cannot collapse multiple bit operations)
    CORCON = 0b11110100;

    // read and compensate ADC offset by MeasCurrParm.Offseta, Offsetb, Offsetc
    // scale currents by MeasCurrParm.qKa, qKb, qKc
    // Calculate ParkParm.qIa, qIb, qIc

    // read and compensate ADC offset by MeasCurrParm.Offseta, Offsetc
    // scale currents by MeasCurrParm.qKa, qKc
    
    //ParkParm.qIa = (int)(__builtin_mulss(MeasCurrParm.Offseta-ADCBuffer[0],MeasCurrParm.qKa)>>14); // TEST 
    //ParkParm.qIc = (int)(__builtin_mulss(MeasCurrParm.Offsetc-ADCBuffer[1],MeasCurrParm.qKc)>>14); // TEST
    
    // Ix_raw = 64 is equal to 49.03 mA current here
    // since we have 10 bits resolution, left aligned, with LSB = 49.03 mA
    
    // gain = 64/49.03
    
    // here we have a first stage filtering
    // each sample is mediated with the previous one
    int Ia = (MeasCurrParm.Offseta-ADCBuffer[0]) / 3;
    int Ic = (MeasCurrParm.Offsetc-ADCBuffer[1]) / 3;
    
    static int IaOld = 0;
    static int IcOld = 0;
    
    ParkParm.qIa = (Ia + IaOld)/2; 
    ParkParm.qIc = (Ic + IcOld)/2;
    ParkParm.qIb = -ParkParm.qIa-ParkParm.qIc;
    
    IaOld = Ia;
    IcOld = Ic;
    
    // gain = (64/49.03) * (1/3)

    int enc = 0;
    static int enc_start_sec = 0;
    BOOL has_speed_sample = FALSE;

    if (MotorConfig.has_qe)
    {
        // overwrite encoders during alignment
        if (sAlignInProgress)
        {
            enc = alignRotor(&IqRef);
        }
        else
        {
            enc = QEgetElettrDeg();
            ElDegfbk = enc;
        }
    }

    has_speed_sample = updateOdometry();

    // enc is in [0 - 360) range here

    char sector = 0;

    if (MotorConfig.has_hall)
    {
#ifdef R1_UPPER_ARM
        static const char dhes2sector[] = {0,2,6,1,4,3,5}; // R1 upper arm
#elif defined(MECAPION)
        static const char dhes2sector[] = {0,6,4,5,2,1,3}; // r1
#else
        static const char dhes2sector[] = {0,6,2,1,4,5,3}; // icub
#endif

        sector = dhes2sector[DHESRead()];
    }
    else
    {
        sector = 1 + enc/60;
    }

    static char sector_stored = 0;
    static char sector_stored_old = 0;

    if (sector_stored != sector)
    {
        if (MotorConfig.has_speed_qe)
        {
            unsigned int poscnt = QEgetRaw();
            static unsigned int poscnt_old = 0x7FFF;

            if (!sAlignInProgress)
            {
                if (poscnt_old == poscnt)
                {
                    if (sector_stored_old != sector)
                    {
                        gEncoderError.phase_broken = TRUE;
                    }
                }
                else
                {
                    poscnt_old = poscnt;
                }
            }
        }

        if (MotorConfig.has_qe)
        {
            if (MotorConfig.has_hall)
            {
                unsigned int poscnt = QEgetRaw();
                static unsigned int poscnt_old = 0x7FFF;
                if (poscnt_old == poscnt)
                {
                    if (sector_stored_old != sector)
                    {
                        gEncoderError.phase_broken = TRUE;
                    }
                }
                else
                {
                    poscnt_old = poscnt;
                }

                if (sector==1 && sector_stored==6) // positive
                {
                    enc_start_sec = enc+30;
                    if (enc_start_sec >=360) enc_start_sec -=360;
                }
                else if (sector==6 && sector_stored==1) // negative
                {
                    enc_start_sec = enc-30;
                    if (enc_start_sec <   0) enc_start_sec +=360;
                }
                else if (sector>sector_stored)
                { // positive rotation
                    enc_start_sec = enc+30;
                    if (enc_start_sec >=360) enc_start_sec -=360;
                }
                else
                { // negative rotation
                    enc_start_sec = enc-30;
                    if (enc_start_sec <   0) enc_start_sec +=360;
                }
            }
        }

