robotology/icub-firmware/emBODY/eBcode/arch-dspic/board/2foc/appl/2FOC-V3/src/2FOC.c
        sector_stored_old = sector_stored;
        sector_stored = sector;

        #define HI(Ix,Vx) iH = &(ParkParm.Ix); ppwmH = &Vx;
        #define LO(Ix,Vx) iL = &(ParkParm.Ix); ppwmL = &Vx;
        #define NE(Ix,Vx) i0 = &(ParkParm.Ix); ppwm0 = &Vx;

        switch (sector) // original
        {
            case 1: HI(qIa,Va) LO(qIb,Vb) NE(qIc,Vc) break; // 1 0 1   5 -> 1
            case 2: HI(qIa,Va) LO(qIc,Vc) NE(qIb,Vb) break; // 1 0 0   4 -> 2
            case 3: HI(qIb,Vb) LO(qIc,Vc) NE(qIa,Va) break; // 1 1 0   6 -> 3
            case 4: HI(qIb,Vb) LO(qIa,Va) NE(qIc,Vc) break; // 0 1 0   2 -> 4
            case 5: HI(qIc,Vc) LO(qIa,Va) NE(qIb,Vb) break; // 0 1 1   3 -> 5
            case 6: HI(qIc,Vc) LO(qIb,Vb) NE(qIa,Va) break; // 0 0 1   1 -> 6
        }
    }

    BOOL negative_sec = sector%2;

    int delta = 0;

    if (MotorConfig.has_hall)
    {
        if (MotorConfig.has_qe)
        {
            delta = enc - enc_start_sec;

            if (delta >= 180) delta -= 360; else if (delta < -180) delta += 360;

            if (delta>30) delta=30; else if (delta<-30) delta=-30;
        }
    }
    else
    {
        delta = (enc%60)-30;
    }

    // back compatibility
    //delta = 0;

    int sinT,cosT;

    if (delta<0)
    {
        cosT =  cos_table[-delta];
        sinT = -sin_table[-delta];
    }
    else
    {
        cosT =  cos_table[ delta];
        sinT =  sin_table[ delta];
    }

    if (negative_sec)
    {
        // gain = (64/49.03) * (2/3) * (2/sqrt3) = 1.0048 OK!
        
        I2Tdata.IQMeasured = /* sqrt3/2 */  (int)(__builtin_mulss((*iH-*iL),cosT)>>15)-3*(int)(__builtin_mulss(   *i0   ,sinT)>>15);
        I2Tdata.IDMeasured = /* 3/2 */     -(int)(__builtin_mulss(   *i0   ,cosT)>>15)-  (int)(__builtin_mulss((*iH-*iL),sinT)>>15);
    }
    else
    {
        I2Tdata.IQMeasured = /* sqrt3/2 */  (int)(__builtin_mulss((*iH-*iL),cosT)>>15)+3*(int)(__builtin_mulss(  *i0    ,sinT)>>15);
        I2Tdata.IDMeasured = /* 3/2 */      (int)(__builtin_mulss(   *i0   ,cosT)>>15)-  (int)(__builtin_mulss((*iH-*iL),sinT)>>15);
    }

    if (!sAlignInProgress)
    {
        // SPEED LOOP
        if (gControlMode == icubCanProto_controlmode_speed_current
         || gControlMode == icubCanProto_controlmode_speed_voltage)
        {
            if (has_speed_sample)
            {
                int speed_error = CtrlReferences.WRef - gQEVelocity;

                if (gControlMode == icubCanProto_controlmode_speed_current)
                {
                    // alternative formulation with ff term
                    IsA += __builtin_mulss(speed_error+speed_error_old,SKi);

                    long IsF = __builtin_mulss(speed_error,SKp) + __builtin_mulss(SKf,CtrlReferences.WRef);
                
                    long IsT = IsA + IsF;
        
                    if (IsT > SIntLimit)
                    {
                        IsA = SIntLimit - IsF;
                        IsT = SIntLimit;
                    }
                    else if (IsT < -SIntLimit)
                    {
                        IsA = -SIntLimit - IsF;
                        IsT = -SIntLimit;
                    }

                    IqRef = (int)(IsT>>SKs);
                }
                else
                {
#ifdef R1_UPPER_ARM
                    if (speed_error || CtrlReferences.WRef)
                    {
#endif
                    VqRef += __builtin_mulss(speed_error-speed_error_old,SKp) + __builtin_mulss(speed_error + speed_error_old,SKi);

                    if (VqRef > SIntLimit) VqRef = SIntLimit; else if (VqRef < -SIntLimit) VqRef = -SIntLimit;
#ifdef R1_UPPER_ARM
                    }
                    else
                    {
                        VqRef = 0;
                    }
#endif

                    IqRef = 0;
                }

                speed_error_old = speed_error;
            } // has_speed_sample
        }
        else if (gControlMode == icubCanProto_controlmode_current)
        {
            VqRef = 0;
            IqRef = CtrlReferences.IqRef;

            if (IqRef>Ipeak) IqRef = Ipeak; else if (IqRef<-Ipeak) IqRef = -Ipeak;
        }
        else if (gControlMode == icubCanProto_controlmode_openloop)
        {
            VqRef = ((long)CtrlReferences.VqRef)<<(IKs-VOLT_REF_SHIFT);
            IqRef = 0;
        }
        else
        {
            VqRef = 0;
            IqRef = 0;
        }
    }
    ////////////////////////////////////////////

    ////////////////////////////////////////////////////////////////////////////
    // Iq control loop

    Vq = 0;

    // CURRENT LOOP
    if (gControlMode == icubCanProto_controlmode_speed_current
     || gControlMode == icubCanProto_controlmode_current
     || sAlignInProgress)
    {
        int iQerror = IqRef-I2Tdata.IQMeasured;

        // alternative formulation with ff term
        VqA += __builtin_mulss(iQerror+iQerror_old,IKi);

        long VqF = __builtin_mulss(iQerror,IKp) + __builtin_mulss(IKbemf,gQEVelocity);
                
        long VqT = VqA + VqF;
        
        if (VqT > IIntLimit)
        {
            VqA = IIntLimit - VqF;
            VqT = IIntLimit;
        }
        else if (VqT < -IIntLimit)
        {
            VqA = -IIntLimit - VqF;
            VqT = -IIntLimit;
        }

        Vq = (int)(VqT>>IKs);
        
        iQerror_old = iQerror;
    }
    else // NO CURRENT CONTROL
    {
        if (I2Tdata.IQMeasured > Ipeak)
        {
            iQprot =  1;
        }
        else if (I2Tdata.IQMeasured < -Ipeak)
        {
            iQprot = -1;
        }

        if (iQprot)
        {
            if (iQprot == 1)
            {
                int iQerror =  Ipeak-I2Tdata.IQMeasured;
                VqL += __builtin_mulss(iQerror-iQerror_old,IKp) + __builtin_mulss(iQerror+iQerror_old,IKi);
                iQerror_old = iQerror;

                if (VqL >= 0) { VqL = 0; iQprot = 0; iQerror_old = 0; }
            }
            else if (iQprot == -1)
            {
                int iQerror = -Ipeak-I2Tdata.IQMeasured;
                VqL += __builtin_mulss(iQerror-iQerror_old,IKp) + __builtin_mulss(iQerror+iQerror_old,IKi);
                iQerror_old = iQerror;

                if (VqL <= 0) { VqL = 0; iQprot = 0; iQerror_old = 0; }
            }

