robotology/icub-firmware/emBODY/eBcode/arch-dspic/board/2foc/appl/2FOC-V3/src/2FOC.c
            Vq = (int)((VqRef+VqL)>>IKs);
        }
        else
        {
            if (gControlMode == icubCanProto_controlmode_openloop)
            {
                Vq = (int)(VqRef>>IKs);
            }
            else // if (gControlMode == icubCanProto_controlmode_speed_voltage)
            {
                Vq = (int)(VqRef>>SKs);
            }
        }
    }
    //
    ////////////////////////////////////////////////////////////////////////////

    ////////////////////////////////////////////////////////////////////////////
    // Id section
    int iDerror = -I2Tdata.IDMeasured;

    VdA += __builtin_mulss(iDerror-iDerror_old,IKp) + __builtin_mulss(iDerror+iDerror_old,IKi);

    iDerror_old = iDerror;

    if (VdA > IIntLimit) VdA = IIntLimit; else if (VdA < -IIntLimit) VdA = -IIntLimit;

    int Vd = (int)(VdA>>IKs);
    //
    ////////////////////////////////////////////////////////////////////////////


    ////////////////////////////////////////////////////////////////////////////
    // if we are close enough to the PCD register shadow copy then wait until
    // its done before updating local PDCs
    // The condition will became false when the PWM is counting down but it is
    // still far from 0 or when it change direction counting up

    // reset the flag that indicates if the PWM registers update was delayed
    BOOL pwm_delayed = FALSE;

    // reset timeout counter that is used to wait for the PWM registers update
    int timeout = PWMSAFETIME;

    //     PWM count DN               PWM count < PWM_SAFE_TIME
    while ((P1TMR & 0x8000) && ((P1TMR & 0x7fff) < PWMSAFETIME))
    {
        pwm_delayed = TRUE;

        if (!--timeout)
        {
            SysError.FirmwarePWMFatalError = TRUE;
            FaultConditionsHandler();
            break;
        }
    }

    if (gSetpointWatchdog>0)
    {
        if (!--gSetpointWatchdog)
        {
            SysError.SetpointExpired = TRUE;
            FaultConditionsHandler();
        }
    }
    
    
////////////////////////////////////////////////////////////////////////////
// CURRENT FILTER
    
    // in a 20 sample window, we discard the 3 lowest and 3 highest current values
    // and then we take the average of the 14 remaining values
    
    static long Vacc = 0; // pwm accumulator for average
    static long Iacc = 0; // current accumulator for average
    static char cntr = 0;
    // extremal values
    static long Imax1 = -1000000; 
    static long Imin1 =  1000000;
    static long Imax2 = -1000000;
    static long Imin2 =  1000000;
    static long Imax3 = -1000000;
    static long Imin3 =  1000000;
    
    if (I2Tdata.IQMeasured <= Imin1) // find the lowest value
    {
        Imin3 = Imin2;
        Imin2 = Imin1;
        Imin1 = I2Tdata.IQMeasured;
    } 
    else if (I2Tdata.IQMeasured <= Imin2) // find the 2nd lowest value
    {
        Imin3 = Imin2;
        Imin2 = I2Tdata.IQMeasured;
    }        
    else if (I2Tdata.IQMeasured <= Imin3) // find the 3rd lowest value
    {
        Imin3 = I2Tdata.IQMeasured;
    }
    
    if (I2Tdata.IQMeasured >= Imax1) // find the highest value
    {
        Imax3 = Imax2;
        Imax2 = Imax1;
        Imax1 = I2Tdata.IQMeasured;
    }
    else if (I2Tdata.IQMeasured >= Imax2) // find the 2nd highest value
    {
        Imax3 = Imax2;
        Imax2 = I2Tdata.IQMeasured;
    }        
    else if (I2Tdata.IQMeasured >= Imax3) // find the 3rd highest value
    {
        Imax3 = I2Tdata.IQMeasured;
    }
        
    // the PWM feedback is smoothed as well since it is transmitted at 1 kHz
    Vacc += Vq<<VOLT_REF_SHIFT;
    Iacc += I2Tdata.IQMeasured;
    
    if (++cntr == 20) // 20 kHz / 20 = 1 kHz 
    {
        cntr = 0;
        
        // subtract extremal values from the accumulator
        Iacc -= Imin1+Imax1+Imin2+Imax2+Imin3+Imax3;
        
        // make the average
        IqFbk = __builtin_divsd(Iacc,14);
        VqFbk = __builtin_divsd(Vacc,20);
        
        Iacc = Vacc = 0;
        Imax1 = Imax2 = Imax3 = -1000000;
        Imin1 = Imin2 = Imin3 =  1000000;
    }

    //
    ////////////////////////////////////////////////////////////////////////////

    ////////////////////////////////////////////////////////////////////////////
    // inv transform and PWM drive
    int V1 = (int)(__builtin_mulss(Vq,cosT)>>15)-3*(int)(__builtin_mulss(Vd,sinT)>>15);
    int V2 = (int)(__builtin_mulss(Vq,sinT)>>15)+  (int)(__builtin_mulss(Vd,cosT)>>15);

    if (negative_sec) V2=-V2;

    *ppwmH =  V1-V2;
    *ppwm0 =  V2+V2;
    *ppwmL = -V1-V2;

    pwmOut(Va,Vb,Vc);
    //
    ////////////////////////////////////////////////////////////////////////////

    ////////////////////////////////////////////////////////////////////////////
    // Invoke the I2T integrator with new current values

    if (!MotorConfig.has_tsens)
    {
        static int i2t_undersampler = 0;

        if (++i2t_undersampler >= 20)
        {
            i2t_undersampler = 0;

            I2Twatcher();
        }
    }

    //
    ////////////////////////////////////////////////////////////////////////////

    ////////////////////////////////////////////////////////////////////////////
    //Clear the DMA0 Interrupt Flag
    IFS0bits.DMA0IF = 0;
}

// When the 2foc loop is not running, the aux service timer
// (hw timer3) will avoid starving of I2T and Encoder services.
// I2T shall continue to discharge integrated data, and
// Encoder service shall mantain turn count in case of
// external torques rotates the axis.

void EnableAuxServiceTimer()
{
    // Enable the aux timer
    Timer3Enable();
}

// When the 2FOC loop is enabled, all core services shall
// run on its behalf.
// In particular I2T and Encoder services are moved from the
// aux timer to the 2FOC loop context.

void DisableAuxServiceTimer()
{
    // do not reschedule the aux timer anymore..
    Timer3Disable();
}

void DriveInit()
// Perform drive SW/HW init
{
    pwmInit(PWM_50_DUTY_CYC, DDEADTIME, PWM_MAX /*pwm max = 96%*/);
    
    // setup and perform ADC offset calibration in MeasCurrParm.Offseta and MeasCurrParm.Offsetc
    ADCDoOffsetCalibration();

#if 0  // to be moved to EnableDrive() but to be tested before  
    pwmON();

    int pwm3_00 = PWM_MAX / 25;

