robotology/icub-firmware/emBODY/eBcode/arch-dspic/board/2foc/appl/2FOC-V3/src/2FOC.c
        SysError.ExternalFaultAsserted = 0;

        if (gControlMode != icubCanProto_controlmode_idle && gControlMode != icubCanProto_controlmode_hwFault)
        {
            DCLinkCheck(ADCVDCLinkTo100mV(ADCGetVDCLink()));
        }

        if (ctrlModeReqCnt == gCtrlModeReqCnt)
        {
            continue;
        }
        else
        {
            ctrlModeReqCnt = gCtrlModeReqCnt;
            ctrlModeReq = gCtrlModeReq;
        }

        if (gControlMode == icubCanProto_controlmode_hwFault)
        {
            if (ctrlModeReq == icubCanProto_controlmode_forceIdle)
            {
                DCLinkReset();
                FaultReset();
                gEncoderError.bitmask = 0;
                gControlMode = icubCanProto_controlmode_idle;
                LED_status.GreenBlinkRate = BLINKRATE_NORMAL;
                LED_status.RedBlinkRate = BLINKRATE_OFF;
                SETPOINT_WATCHDOG_REARM()
            }

            continue;
        }

        if (gControlMode == icubCanProto_controlmode_idle)
        {
            if (ctrlModeReq==icubCanProto_controlmode_current
              ||ctrlModeReq==icubCanProto_controlmode_speed_voltage
              ||ctrlModeReq==icubCanProto_controlmode_speed_current
              ||ctrlModeReq==icubCanProto_controlmode_openloop)
            {
                gControlMode = ctrlModeReq;
                LED_status.GreenBlinkRate=BLINKRATE_STILL;
                LED_status.RedBlinkRate=BLINKRATE_OFF;
                SETPOINT_WATCHDOG_REARM()
                EnableDrive();
            }

            continue;
        }

        if (gControlMode == icubCanProto_controlmode_current
         || gControlMode == icubCanProto_controlmode_speed_voltage
         || gControlMode == icubCanProto_controlmode_speed_current
         || gControlMode == icubCanProto_controlmode_openloop)
        {
            if (ctrlModeReq == icubCanProto_controlmode_idle
             || ctrlModeReq == icubCanProto_controlmode_forceIdle)
            {
                DisableDrive();

                gControlMode = icubCanProto_controlmode_idle;
                LED_status.GreenBlinkRate = BLINKRATE_NORMAL;
                LED_status.RedBlinkRate=BLINKRATE_OFF;

                continue;
            }

            if (ctrlModeReq == icubCanProto_controlmode_current
             || ctrlModeReq == icubCanProto_controlmode_speed_voltage
             || ctrlModeReq == icubCanProto_controlmode_speed_current
             || ctrlModeReq == icubCanProto_controlmode_openloop)
            {
                ZeroControlReferences();
                SETPOINT_WATCHDOG_REARM()
                gControlMode = ctrlModeReq;

                continue;
            }

            continue;
        }
    }
    // should never arrive here!
    while (1);

    asm("NOP");
    asm("NOP");
    asm("NOP");
    asm("NOP");
    asm("NOP");
}

#ifdef CALIBRATION
    else
    {
        static unsigned long cycle = 0;

        ++cycle;

        if (cycle < 20000)
        {
            enc = 2400;
            if (IqCalib<UDEF_CURRENT_MAX/2) ++IqCalib;
        }
        else if (cycle < 100000)
        {
            enc = 2400;
            if (IqCalib>0) --IqCalib;
        }
        else if (cycle < 120000)
        {
            enc = 0;
            if (IqCalib<UDEF_CURRENT_MAX/2) ++IqCalib;
        }
        else if (cycle < 200000)
        {
            enc = 0;
            if (IqCalib>0) --IqCalib;
        }
        else if (cycle < 220000)
        {
            enc = 1200;
            if (IqCalib<UDEF_CURRENT_MAX/2) ++IqCalib;
        }
        else if (cycle < 300000)
        {
            enc = 1200;
            if (IqCalib>0) --IqCalib;
        }
        else if (cycle < 320000)
        {
            enc = 0;
            if (IqCalib<UDEF_CURRENT_MAX/2) ++IqCalib;
        }
        else if (cycle < 400000)
        {
            enc = 0;
            if (IqCalib>0) --IqCalib;
        }
        else cycle = 0;

    }
#endif

/*
void DriveSelfTest()
// Perform drive HW selftest
{

    // Check silicon revion
    //SiliconRevionTest();

    // Selftest EMUROM
    //EepromTest();

    // Selftest EMUROM
    //EncoderSelfTest();

    // Test ADC offset
    //ADCDoOffsetTest();

    // TODO: vedere se possibile verificare l'oscillatore e la verifica di porte di IO
}
*/


//void updateGulp(void)
//{
    //if (!gulp_update_request) return;

    //Gulp.W[0] = POSCNT;//gulp_mec;
    //Gulp.W[1] = gulp_enc;//gQEVelocity; //gQEVelocity;//gTemperature; //encoder_error;
    //Gulp.W[2] = gulp_sector;//gTemperature;//overf_cnt; // gQEPosition & 0xFFFF;
    //Gulp.W[3] = I2Tdata.IQMeasured;//i2cERRORS;    // gQEPosition>>16;

    //Gulp.W[0] = I2Tdata.IQMeasured;
    //Gulp.W[1] = gQEVelocity;
    //Gulp.W[2] = gQEPosition & 0xFFFF;
    //Gulp.W[3] = gQEPosition >> 16;

    //Gulp.W[0] = *gulpadr1;
    //Gulp.W[1] = *gulpadr2;
    //Gulp.W[2] = *gulpadr3;
    //Gulp.W[3] = *gulpadr4;

    // unlock the main loop, so it will read values just updated
    //gulp_update_request = 0;

    // read VDC link raw value;
    //VDCLink = ADCGetVDCLink();
//}

    /*
void SiliconRevionTest()
// checks for proper silicon revision
{
    unsigned int devrev;

    // read silicon chip revision
    _memcpy_p2d16(&devrev, 0xff0002, sizeof (devrev));

    if (devrev != 0x3003)
    {

        // TODO: trigger fault really ?

        SysError.SiliconRevisionFault = 1;
    }
}
*/

/*
void EncoderSelfTest()
// encoder selftest (when possible)
{
    // TODO: giustappunto.

}
*/

/*
void ADCDoOffsetTest()
// ADC Offset test
{
    // TODO: giustappunto.
    // A questo punto la calibrazioni e stata fatta
    // Se e' fallita e noi qui resettiamo il flag allora
    // non sapremo mai se e' fallita!!
    // SysError.ADCCalFailure = 0;
}
*/